{
  "kind": "build_request",
  "title": "Romantic interactive gift-box web experience with voice and animations",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a single-page romantic interactive experience that initially shows a cute animated gift box centered on the screen over a soft romantic pink/purple gradient background.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "When a user enters the website, the screen shows a cute animated gift box in the center.\nBackground should be soft romantic (pink / purple gradient)."
        ]
      },
      "acceptanceCriteria": [
        "On first load, only the gift box scene is visible (centered) with a pink/purple gradient background.",
        "Layout is responsive and remains centered on common mobile viewport sizes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement voice playback using the browser Web Speech API to speak: \"Medha, open your gift\" on initial load, with a graceful fallback UX for browsers that block autoplay (e.g., show a small on-screen prompt to enable sound via a tap/click).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Automatically play a female soft voice saying:\n   \"Medha, open your gift\"\n   (use Web Speech API or AI voice integration)."
        ]
      },
      "acceptanceCriteria": [
        "If the browser permits, the phrase is spoken on page load using SpeechSynthesis.",
        "If autoplay is blocked, the UI displays a clear, non-intrusive prompt (tap/click) that enables speech and then plays the phrase.",
        "If SpeechSynthesis is unavailable, the app does not crash and displays a short message indicating voice is unsupported."
      ]
    },
    {
      "id": "REQ-3",
      "text": "On gift box click/tap, run a single, smooth animation sequence: gift opens; a cute animated boy and cute animated girl appear; the boy walks forward and kneels; heart animations float in the background; the voice speaks \"I love you\"; and the on-screen text \"I love you ❤️\" appears.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "When the user clicks the gift box:\n   - The gift opens with smooth animation.\n   - A cute animated boy and a cute animated girl appear.\n   - The boy walks forward and kneels down.\n   - A heart animation floats in the background.\n   - Voice plays:\n     \"I love you\"\n   - Text appears on screen: \"I love you ❤️\""
        ]
      },
      "acceptanceCriteria": [
        "Clicking/tapping the gift box triggers the full sequence exactly once (subsequent clicks do not restart mid-sequence).",
        "Gift opening animation is visibly smooth (CSS animations/transitions).",
        "Boy and girl are hidden before the click and appear as part of the sequence.",
        "Boy visibly moves forward and transitions into a kneeling pose/state as part of the sequence.",
        "Hearts float in the background during/after the reveal sequence.",
        "After the click sequence begins, the app speaks \"I love you\" (or prompts to enable sound if blocked) and displays the text \"I love you ❤️\" on screen."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement the interactive scene using clean, well-commented React + TypeScript code and CSS/Tailwind styling (no adult content), keeping the overall look cute, romantic, and consistent across components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Mobile responsive\n- Clean, romantic, cute style (no adult content)\n- Clear comments in code"
        ]
      },
      "acceptanceCriteria": [
        "Code includes clear comments explaining the animation sequence, state transitions, and voice playback handling.",
        "Visual style is cute/romantic and contains no adult or explicit content.",
        "All UI text shown to users is in English."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Do not implement a Python/Flask server; instead, serve the site using the existing Internet Computer frontend setup and keep the backend minimal (no backend changes unless needed for serving or configuration).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Python Flask backend to serve files\nDeliver:\n- index.html\n- style.css\n- script.js\n- app.py (Flask server)"
        ]
      },
      "acceptanceCriteria": [
        "The app runs within the provided React frontend template and does not add Python/Flask files.",
        "No backend functionality is added unless strictly required; if no backend calls are needed, backend remains unchanged."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add any required custom art as static assets (not served through the backend) and reference them from the frontend. Prefer cute, simple illustrations that match the romantic theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "A cute animated gift box in the center.\nA cute animated boy and a cute animated girl appear.\nA heart animation floats in the background."
        ]
      },
      "acceptanceCriteria": [
        "Any generated images are placed under frontend/public/assets/generated and loaded directly by the frontend.",
        "The scene renders correctly even if voice playback is unavailable (visuals still work)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor; do not introduce additional backend services.",
    "Do not edit files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT; compose them instead if needed.",
    "Do not add Python/Flask; implement within the provided React + Motoko template.",
    "Voice playback must use in-browser capabilities (Web Speech API); no third-party AI voice integrations requiring external services."
  ],
  "nonGoals": [
    "User accounts or authentication flows.",
    "Persistent storage of user interactions.",
    "Real-time features (chat, websockets).",
    "Integrations with external AI/voice APIs or third-party services."
  ],
  "imageRequirements": {
    "required": [
      "Cute closed gift box illustration, front view, soft pastel style (gift-box-closed.dim_512x512.png)",
      "Cute open gift box illustration, matching style (gift-box-open.dim_512x512.png)",
      "Cute cartoon boy character, standing pose, transparent background (cute-boy-stand.dim_512x512.png)",
      "Cute cartoon boy character, kneeling pose, transparent background (cute-boy-kneel.dim_512x512.png)",
      "Cute cartoon girl character, standing pose, transparent background (cute-girl-stand.dim_512x512.png)",
      "Small floating heart icon set style (heart-icon.dim_128x128.png)"
    ],
    "edits": []
  }
}